'''
Нужно написать программу, которая получает два числа
и выполняет с ними: +, -, *, /, **
'''
n1 = int(input('Введи число: '))
n2 = int(input('Введи число: '))

print(n1 + n2)
print(n1 - n2)
print(n1 * n2)
print(n1 / n2)
print(n1 ** n2)

